---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsEndConstraintChanged
source: html/e0f39d9d-c6f6-6171-2417-f8955fd9df48.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsEndConstraintChanged Property

Indicates if the end handle constraint has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsEndConstraintChanged { get; }
```